var skills = [
    {
        "title" : "Python",
        "subtitle" : "My primary (and favorite) programming language.",
        "text" : "Learned through academic work and side projects. Relevant technologies include Flask, scikit-learn, numpy, keras with tensorflow, pytorch, pickle, io",
        "tags" : ["proficient", "personal", "school"],
    },
    {
        "title" : "php",
        "subtitle" : "$txt = 'I love php!';",
        "text" : "Learned through professional work. Relevant technologies include Symfony, Doctrine, phpMyAdmin, Codeception, twig",
        "tags" : ["proficient", "work"],
    },
    {
        "title" : "Java",
        "subtitle" : "String str = 'Hello, Java!';",
        "text" : "Learned through academic work. Also my first programming language",
        "tags" : ["proficient", "school"]
    },
    {
        "title" : "Web development",
        "subtitle" : "<p>Does this really count?</p>",
        "text" : "Learned through academic and professional work. Relevant technologies include HTML, CSS, Javascript, jQuery,Bootstrap.",
        "tags" : ["proficient", "work", "school", "personal"]
    },
    {
        "title" : "C/C++",
        "subtitle" : "string str1 = 'C U later'",
        "text" : "Learned through academic work. Notable work includes a course lookup server.",
        "tags" : ["school"]
    },
    {
        "title" : "Go",
        "subtitle" : "var str := ''Howdy, world!''",
        "text" : "Learned through academic work. Notable work includes implementations of MapReduce, a server backup system, Paxos, and a sharded key-value server.",
        "tags" : ["school"]
    },
    {
        "title" : "OCaml" ,
        "subtitle" : "",
        "text" : "Learned through academic work. Notable work includes custom programming language based on Go.",
        "tags" : ["school"]
    },
    {
        "title" : "git",
        "subtitle" : "git commit -m 'add skills section'",
        "text" : "Learned through academic and professional work. Most of my work resides on Github, but I have also used BitBucket for work and other projects.",
        "tags" : ["proficient", "work", "school", "personal"]
    },
    {
        "title" : "Agile project management",
        "subtitle" : "As a developer, I want to write good code so that I have to debug as little as possible.",
        "text" : "Learned through academic and professional work. Especially familiar with Jira for full development cycle.",
        "tags" : ["proficient", "work", "school"]
    },
    {
        "title" : "Microsoft Office and Google Drive",
        "subtitle" : "Do programmers write essays?",
        "text" : "Learned through academic and professional work. Very familiar with Office, Excel, and Powerpoint and Google equivalents.",
        "tags" : ["proficient", "school", "work"]
    },
    {
        "title" : "Graphic design",
        "subtitle" : "Who better to make your graphics than yourself?",
        "text" : "Learned through professional work and interest on the side. Notable work includes clothing designs for Columbia Engineering student council with hundreds of sales. Relevant technologies include inDesign, GIMP.",
        "tags" : ["proficient", "work", "personal"]
    },
    {
        "title" : "Photo editing",
        "subtitle" : "Gotta look pretty.",
        "text" : "Learned as a hobby. Relevant technologies include GIMP, Adobe Photoshop.",
        "tags" : ["proficient", "personal"]
    },
    {
        "title" : "Video editing",
        "subtitle" : "No need for greenscreens here.",
        "text" : "Learned as a hobby. Have created some vlogs from travels. Relevant technologies include DaVinci Resolve, Adobe Premiere, Sony Vegas.",
        "tags" : ["proficient", "personal"]
    },
    {
        "title" : "German",
        "subtitle" : "Hallo Welt, wie geht's dir?.",
        "text" : "Learned through academic work. Completed minor in Germanic culture and language.",
        "tags" : ["proficient", "school"]
    },
    {
        "title" : "Spanish",
        "subtitle" : "Hola Mundo, ¿cómo estás?",
        "text" : "Some learned through academic work and growing up. Very basic level.",
        "tags" : ["school", "personal"]
    },
    {
        "title" : "Tagalog",
        "subtitle" : "Kamusta ka?",
        "text" : "Learned growing up. Conversational level, no formal training.",
        "tags" : ["personal"],
    },
];


var work = [
    {
        "company" : "Columbia Business School<br/>New York City, New York",
        "role" : "Lead software engineer",
        "duration" : "Sep. 2018 -<br>present",
        "notes": "Modernizing DEEP survey system for research in time- and risk-based decision making. Converting application from Ruby on Rails to PHP utilizing LAMP (Linux, Apache, MySQL, PHP) stack to update outdated technology of program and increase efficiency of survey system. Directing system architecture implementation using agile management to accommodate client’s needs and to expedite overall product development cycle"
    },
    {
        "company" : "Columbia College Information Technology<br/>New York City, New York",
        "role" : "Software engineering intern",
        "duration" : "June 2017 -<br>May 2018",
        "notes": "Redesigned, implemented, and tested Columbia’s undergraduate lottery for tickets to sports, Broadway musicals, and other events around NYC. Participated in full development cycle, code reviews, daily stand-ups, and other aspects of agile software development with other members of engineering team. Utilized PHP (Symfony, Doctrine), front-end stack of HTML, CSS, Bootstrap; SQL, and git for application development"
    },
    {
        "company" : "Columbia College Information Technology<br/>New York City, New York",
        "role" : "Desktop support intern",
        "duration" : "June 2016 -<br/>May 2017",
        "notes" : "Assisted in management and troubleshooting of hardware and software across all levels of Columbia College’s administration. Analyzed and corrected computing problems and technology issues remotely and in-person. Developed relationships with staff and clients to tailor support personally to each individual "
    },
    {
        "company" : "Columbia University Alumni Center<br/>New York City, New York",
        "role" : "Student fundraiser",
        "duration" : "Jan. 2016 -<br/>Aug. 2016",
        "notes" : "Kept up-to-date with alumni, fostered a sense of community within the alumni network, and fundraised for Columbia’s annual fund through alumni and friends of the university."
    },
    {
        "company" : "Columbia University Athletics Department<br/>New York City, New York",
        "role" : "Intramural referee",
        "duration" : "Sep. 2015 -<br/>Aug. 2016",
        "notes" : "Kept score of and officiated intramural soccer, basketball, and volleyball games and maintained a fun, competitive, and safe environment on the field."
    },
    {
        "company" : "RumorFix<br/>Venice, California",
        "role" : "Intern",
        "duration" : "May 2015 -<br/>Aug. 2015",
        "notes" : "Maintained Facebook ad campaign with reports on efficiency and effectiveness under guidance of vice president of marketing. Also helped content copy team in writing articles centered on pop culture icons."
    },
    {
        "company" : "Los Angeles World's Fair<br/>Venice, California",
        "role" : "Intern",
        "duration" : "Summers 2014, 2015",
        "notes" : "Assisted executive director in the planning and execution of major crowdfunding events for the Los Angeles World’s Fair around the greater Los Angeles city area."
    },

];

var projects = [
    {
        "title" : "MNIST Classifier",
        "text" : "A side project to keep my feet wet with machine learning, I developed a classifier for the MNIST handwritten digits dataset. I implemented an architecture based on VGG and achieved an accuracy of 89%.",
        "img" : "img/projects/mnist.png",
        "link" : "",
        "footnote" : "Summer 2018",
        "tags" : ["personal"],
    },
    {
        "title" : "Learn2Play",
        "text" : "Ever have trouble learning something from YouTube? Use Learn2Play to split up and loop your videos to get each part down before putting them all together!",
        "img" : "img/projects/learn2play.png",
        "link" : "pages/learn2play",
        "footnote" : "COMS 4170, User Interface Design, Spring 2018",
        "tags" : ["school"],
    },
    {
        "title" : "Paper Infinity",
        "text" : "A system for paper company employees to manage sales with clients and determine who is and isn't on the party planning committee.",
        "img" : "img/projects/columbia-paper-infinity.png",
        "link" : "pages/paper-infinity",
        "footnote" : "COMS 4170, User Interface Design, Spring 2018",
        "tags" : ["school"],
    },
    {
        "title" : "Gmail Mockup",
        "text" : "A mockup of Gmail using HTML, CSS, and Bootstrap. There's no functionality to the site, but at least it looks pretty.",
        "img" : "img/projects/gmail.png",
        "link" : "pages/gmail-mockup",
        "footnote" : "COMS 4170, User Interface Design, Spring 2018",
        "tags" : ["school"],
    },
    {
        "title" : "Under My UmbReLU",
        "text" : "A potential solution to <strong>S</strong>tanford's <strong>Qu</strong>estion <strong>A</strong>nswering <strong>D</strong>ataset (<strong>SQuAD</strong>). My team and I based our architecture on a previous submission but used Keras on Tensorflow for our implementation.",
        "img" : "img/projects/under_my_umbrelu.png",
        "img_title" : "Network overview based on and courtesy of Xiong et al. (2016)",
        "link" : "https://www.dropbox.com/s/caxtd737fzg93i4/under_my_umbReLU.pdf",
        "footnote" : "COMS 4995 Deep Learning, Spring 2018",
        "tags" : ["school"],
    },
    {
        "title" : "Senior Scramble",
        "text" : "My friend and I developed this script for student council, who used it to match seniors mutually interested in one another and help them get in touch.",
        "img" : "img/projects/senior-scramble.png",
        "img_title" : "Definition courtsey of Urban Dictionary",
        "link" : "",
        "footnote" : "Engineering Student Council, Spring 2018",
        "tags" : ["work", "personal"],
    },
    {
        "title" : "GoBackwards",
        "text" : "A simplified implementation of the Go language that also included an image-to-ascii art printer. Developed in OCaml.",
        "img" : "img/projects/gobackwards.png",
        "link" : "https://www.dropbox.com/s/yxoy0apf4np3hb7/gobackwards.pdf",
        "footnote" : "COMS 4115 Programming Languages and Translators, Fall 2017",
        "tags" : ["school"],
    },
    {
        "title" : "scheduLIT",
        "text" : "Collaboritve planning taken a step further. scheduLIT allows travelers to plan trips together on one site with complete transparency and clarity, keeping all members of the group informed and guaranteeing a good time for all. Presented at JP Morgan.",
        "img" : "img/projects/schedulit.png",
        "link" : "https://github.com/andres-aguayo/ASE_CodersWhoParty_Fall2017",
        "footnote" : "COMS 4156 Advanced Software Engineering, Fall 2017",
        "tags" : ["school"],
    },
    {
        "title" : "Othello Bot",
        "text" : "Using a modified version of the minimax algorithm, this computer opponent can successfully play the classic game of Othello with a decent win-rate. GUI and base Othello functions courtesy of the Artificial Intelligence course for which this bot was designed.",
        "img" : "img/projects/othello.png",
        "link" : "",
        "footnote" : "COMS 4701 Artificial Intelligence, Fall 2017",
        "tags" : ["school"],
    },
    {
        "title" : "Westerosi Social Network",
        "text" : "A simple implementation of a social network with groups and messages. Designed to demonstrate database uses and operations. Based on the complex social atmosphere of <em>Game of Thrones</em>.",
        "img" : "img/projects/wsn.png",
        "img_title" : "Image courtsey of HBO",
        "link" : "",
        "footnote" : "COMS 4111 Introduction to Databases, Spring 2017",
        "tags" : ["school"],
    },
    {
        "title" : "Free Fu'd",
        "text" : "A project for the Application Development Initiative’s (ADI) annual Devfest, Free Fu’d is a text messaging based service that would scrape the university’s  event management calendar and inform the user of events with free food on campus that day. ",
        "img" : "img/projects/devfest.png",
        "link" : "Image courtesy of ADI",
        "footnote" : "ADI Devfest, Spring 2016",
        "tags" : ["personal"],
    },

];
